In [2]:
import pandas as pd

In [3]:
[1, 2, 3, 4]

[1, 2, 3, 4]

In [4]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [30]:
df = pd.DataFrame(
    {"one": [2, 1, 3, 4], "two": ["a", "b", "c", "d"], "three": ["D", "C", "B", "A"]}
)
df

   one two three
0    2   a     D
1    1   b     C
2    3   c     B
3    4   d     A

Selection

In [31]:
df["one"]

0    2
1    1
2    3
3    4
Name: one, dtype: int64

In [32]:
df[["two", "three"]]

  two three
0   a     D
1   b     C
2   c     B
3   d     A

In [33]:
df["one"]

0    2
1    1
2    3
3    4
Name: one, dtype: int64

In [34]:
df[["one"]]

   one
0    2
1    1
2    3
3    4

In [35]:
df.loc[2:3, ["one", "three"]]

   one three
2    3     B
3    4     A

In [40]:
df.iloc[2:4, 1:3]

  two three
2   c     B
3   d     A

Filter rows

In [37]:
df[df["one"] > 2]

   one two three
2    3   c     B
3    4   d     A

In [38]:
df["one"] > 2

0    False
1    False
2     True
3     True
Name: one, dtype: bool

In [39]:
df[df["two"].isin(["a", "d"])]

   one two three
0    2   a     D
3    4   d     A

In [41]:
df["two"].isin(["a", "d"])

0     True
1    False
2    False
3     True
Name: two, dtype: bool

Operations

In [42]:
df.assign(four=["hello", "world", "goodbye", "world"])

   one two three     four
0    2   a     D    hello
1    1   b     C    world
2    3   c     B  goodbye
3    4   d     A    world

In [43]:
df.assign(five=df["one"] + 1)

   one two three  five
0    2   a     D     3
1    1   b     C     2
2    3   c     B     4
3    4   d     A     5